In [10]:
import mysql.connector
from mysql.connector import Connect,Error

try:
    con = Connect(
        host = "localhost",
        port = 3307,
        user = "root",
        password="Appu_2003",
        database="dbstudent",
    )
except Error as e:
    print(e)

In [11]:
cursor = con.cursor()

In [12]:
# Making cursor to execute queries
cursor.execute("show databases")
# Iterating throught cursor for records
for db in cursor:
    print(db)

('dbstudent',)
('information_schema',)
('java',)
('java_termwork',)
('mysql',)
('performance_schema',)
('pydb',)
('sem_1',)
('student',)
('sys',)
('termwork_1',)

In [ ]:
# Creating a new database
try:
    cursor.execute("Create Database dbStudent")
except Error as e:
    print(e)

In [ ]:
# Create table
sql = """CREATE TABLE tblstudent (
    roll int,
    name varchar(30),
    birthdate date,
    gender enum('M','F'),
    cmarks int,
    cpp int,
    python int,
    total int,
    percentage float(6,2)
    )"""
    
try:
    cursor.execute(sql)
except Error as e:
    print(e)

In [9]:
try:
    cursor.execute("DESC tblstudent")
    for db in cursor:
        print(db)
except Error as e:
    print(e)

Unread result found

In [ ]:
# Inserting records in the table
sql="INSERT INTO tblstudent (roll,name,birthdate,gender,cmarks,cpp,python) values(%s,%s,%s,%s,%s,%s,%s)"
values=((1, 'Saraswati', '2001-07-15', 'F', 85, 70, 80),
        (2, 'Shyam', '2001-09-15', 'M', 80, 75, 85),
        (3, 'Sita', '2002-04-25', 'F', 70, 85, 90),
        (4, 'Gita', '2001-11-10', 'F', 65, 70, 75),
        (5, 'Hari', '2001-08-20', 'M', 90, 80, 95),
        (6, 'Mohan', '2002-01-05', 'M', 85, 90, 80),
        (7, 'Radha', '2001-12-30', 'F', 75, 85, 70),
        (8, 'Krishna', '2002-06-10', 'M', 95, 85, 90),
        (9, 'Laxmi', '2001-03-12', 'F', 70, 75, 85),
        (10, 'Gopal', '2002-09-28', 'M', 80, 95, 75))

try:
    cursor.executemany(sql,values)
    con.commit()
except Error as e:
    print(e)

In [13]:
# Fetching records from table
cursor.execute("Select * from tblstudent")
records = cursor.fetchall()
for r in records:
    print(r)

(1, 'Saraswati', datetime.date(2001, 7, 15), 'F', 85, 70, 80, 235, 78.33)
(2, 'Shyam', datetime.date(2001, 9, 15), 'M', 80, 75, 85, 240, 80.0)
(3, 'Sita', datetime.date(2002, 4, 25), 'F', 70, 85, 90, 245, 81.67)
(4, 'Gita', datetime.date(2001, 11, 10), 'F', 65, 70, 75, 210, 70.0)
(5, 'Hari', datetime.date(2001, 8, 20), 'M', 90, 80, 95, 265, 88.33)
(6, 'Mohan', datetime.date(2002, 1, 5), 'M', 85, 90, 80, 255, 85.0)
(7, 'Radha', datetime.date(2001, 12, 30), 'F', 75, 85, 70, 230, 76.67)
(8, 'Krishna', datetime.date(2002, 6, 10), 'M', 95, 85, 90, 270, 90.0)
(9, 'Laxmi', datetime.date(2001, 3, 12), 'F', 70, 75, 85, 230, 76.67)
(10, 'Gopal', datetime.date(2002, 9, 28), 'M', 80, 95, 75, 250, 83.33)

In [ ]:
# Calling procedure
cursor.callproc("c_marks")
# Loop for each row
for r in cursor.stored_results():
    # loop for columns in the row
    for c in r:
        print(c)

In [ ]:
# Compute total,percentage,marks
sql="select * from tblstudent"
cursor.execute(sql)
records = cursor.fetchall()
for r in records:
    roll = r[0]
    # Find total
    total = r[4]+r[5]+r[6]
    sql = "update tblstudent set total = %s where roll = %s"
    val = (total,r[0])
    cursor.execute(sql,val)
con.commit()
    
    
    # Find percentage
for r in records:
    roll = r[0]
    total = r[4]+r[5]+r[6]
    per = total/3
    sql1 = "update tblstudent set percentage = %s where roll = %s"
    val1 = (per,r[0])
    cursor.execute(sql1,val1)
con.commit()

In [14]:
# Print merit
sql = "select * from tblstudent order by percentage desc"
cursor.execute(sql)
records = cursor.fetchall()
for r in records:
    print(r)

(8, 'Krishna', datetime.date(2002, 6, 10), 'M', 95, 85, 90, 270, 90.0)
(5, 'Hari', datetime.date(2001, 8, 20), 'M', 90, 80, 95, 265, 88.33)
(6, 'Mohan', datetime.date(2002, 1, 5), 'M', 85, 90, 80, 255, 85.0)
(10, 'Gopal', datetime.date(2002, 9, 28), 'M', 80, 95, 75, 250, 83.33)
(3, 'Sita', datetime.date(2002, 4, 25), 'F', 70, 85, 90, 245, 81.67)
(2, 'Shyam', datetime.date(2001, 9, 15), 'M', 80, 75, 85, 240, 80.0)
(1, 'Saraswati', datetime.date(2001, 7, 15), 'F', 85, 70, 80, 235, 78.33)
(7, 'Radha', datetime.date(2001, 12, 30), 'F', 75, 85, 70, 230, 76.67)
(9, 'Laxmi', datetime.date(2001, 3, 12), 'F', 70, 75, 85, 230, 76.67)
(4, 'Gita', datetime.date(2001, 11, 10), 'F', 65, 70, 75, 210, 70.0)

In [ ]:
# Print two toppers
sql = "select * from tblstudent order by percentage desc limit 2"
cursor.execute(sql)
records = cursor.fetchall()
for r in records:
    print(r)

In [15]:
# Youngest female topper
sql = "select * from tblstudent where birthdate in (select min(birthdate) from tblstudent where gender = 'F')order by percentage desc"

cursor.execute(sql)
records = cursor.fetchall()
for r in records:
    print(r)

(9, 'Laxmi', datetime.date(2001, 3, 12), 'F', 70, 75, 85, 230, 76.67)

In [16]:
sql = "select * from tblstudent where birthdate in (select max(birthdate) from tblstudent where gender = 'M')order by percentage desc"

cursor.execute(sql)
records = cursor.fetchall()
for r in records:
    print(r)

(10, 'Gopal', datetime.date(2002, 9, 28), 'M', 80, 95, 75, 250, 83.33)

In [ ]:
params = (11, 'Vatsal', '2001-07-15', 'M', 85, 70, 80,235,78.33)
cursor.callproc("insert_student",params)